list_a = ["янаврь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
dict_a = {1 : "зимний", 2 : "весенний", 3 : "летний", 4 : "осенний"}
x = int(input("Введите номер месяца(от 1 до 12): "))
y = int(x - 1)
if x == 12 or x == 1 or x == 2:
    print(list_a[y], "-", dict_a.get(1), "месяц")
elif x >= 3 and x <= 5:
    print(list_a[y], "-", dict_a.get(2), "месяц")
elif x >= 6 and x <= 8:
    print(list_a[y], "-", dict_a.get(3), "месяц")
elif x >= 9 and x <= 11:
    print(list_a[y], "-", dict_a.get(4), "месяц")
