#5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

list_abc = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"]

index = int(input("Введите номер буквы: "))

if index <= len(list_abc):
    print(f'Буква под номером {index} - {list_abc[index - 1]}')
else:
    print("Введен не верный номер буквы")